; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared6 - mode
	spectrograph0 - mode
	image5 - mode
	image1 - mode
	infrared3 - mode
	thermograph2 - mode
	spectrograph4 - mode
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation10 - direction
	Star11 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	Star12 - direction
	GroundStation0 - direction
	GroundStation6 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(supports instrument0 image5)
	(supports instrument0 infrared6)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
)
(:goal (and
	(have_image Star13 spectrograph0)
	(have_image Star13 image5)
	(have_image Phenomenon14 infrared3)
	(have_image Phenomenon14 spectrograph4)
	(have_image Planet15 spectrograph4)
	(have_image Planet15 infrared3)
	(have_image Phenomenon16 spectrograph4)
))

)

; plan
1. (turn_to satellite0 groundstation0 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 groundstation6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 7
5. (turn_to satellite0 phenomenon14 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 7
6. (take_image satellite0 phenomenon14 instrument0 infrared3)
   added: (have_image phenomenon14 infrared3)
   goals met: 1 of 7
7. (turn_to satellite0 planet15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet15)
   goals met: 1 of 7
8. (take_image satellite0 planet15 instrument0 infrared3)
   added: (have_image planet15 infrared3)
   goals met: 2 of 7
9. (turn_to satellite0 star13 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star13)
   goals met: 2 of 7
10. (take_image satellite0 star13 instrument0 image5)
   added: (have_image star13 image5)
   goals met: 3 of 7
11. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 7
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 7
13. (turn_to satellite0 groundstation6 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation6)
   goals met: 3 of 7
14. (calibrate satellite0 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 3 of 7
15. (turn_to satellite0 phenomenon14 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 7
16. (take_image satellite0 phenomenon14 instrument1 spectrograph4)
   added: (have_image phenomenon14 spectrograph4)
   goals met: 4 of 7
17. (turn_to satellite0 phenomenon16 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon16)
   goals met: 4 of 7
18. (take_image satellite0 phenomenon16 instrument1 spectrograph4)
   added: (have_image phenomenon16 spectrograph4)
   goals met: 5 of 7
19. (turn_to satellite0 planet15 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet15)
   goals met: 5 of 7
20. (take_image satellite0 planet15 instrument1 spectrograph4)
   added: (have_image planet15 spectrograph4)
   goals met: 6 of 7
21. (turn_to satellite0 star13 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star13)
   goals met: 6 of 7
22. (take_image satellite0 star13 instrument1 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 7 of 7
